In [1]:
%matplotlib inline

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
!cat ch06/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv('ch06/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
df2 = pd.read_table('ch06/ex1.csv', sep=',')

In [7]:
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_csv('ch06/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [11]:
pd.read_csv('ch06/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
names = ['a', 'b', 'c', 'd', 'message']

In [13]:
pd.read_csv('ch06/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [14]:
parsed = pd.read_csv('ch06/csv_mindex.csv', index_col=['key1', 'key2'])

In [15]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [17]:
list(open('ch06/ex3.txt'))

['        A     B     C\n',
 'aaa -0.26 -1.02 -0.61\n',
 'bbb  0.92  0.12  0.21\n',
 'ccc -0.11 -0.43  0.23\n',
 'ddd -0.81 -0.91  0.21\n']

In [18]:
result = pd.read_table('ch06/ex3.txt', sep='\s+')

In [19]:
result

        A     B     C
aaa -0.26 -1.02 -0.61
bbb  0.92  0.12  0.21
ccc -0.11 -0.43  0.23
ddd -0.81 -0.91  0.21